# GetGroupTypeId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Definition..::..GetGroupTypeId Method
Definition Class See Also
---
Returns the identifier of the parameter definition's parameter group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract ForgeTypeId GetGroupTypeId()
```

Visual Basic
---
```text
Public MustOverride Function GetGroupTypeId As ForgeTypeId
```

Visual C++
---
```text
public:
virtual ForgeTypeId^ GetGroupTypeId() abstract
```

# See Also
Definition Class
Autodesk.Revit.DB Namespace